export const theme = Object.freeze({
  colors: {
    background: '#F4F4F9', // Основной фон сайта: светло-серый для чистого и нейтрального вида
    backgroundSecondary: '#2B3A67', // Второй фон сайта для хедера и футера: темно-синий для контраста
    backgroundimage: '#D3D3E1',

    title: '#333333', // Цвет заголовков и текста: темно-серый для хорошей читаемости и контраста

    text: '#666666', // Основной цвет текста: серый для удобного чтения
    textWhite: '#FFFFFF', // Цвет текста для элементов, где нужен белый цвет
    textSecondary: '#999999', // Второй цвет текста для выделения: светло-серый оттенок для добавления разнообразия

    btn: '#FF9800', // Цвет кнопок основной: яркий оранжевый для акцента
    btnHover: '#FFB74D', // Цвет кнопок при наведении: светло-оранжевый для выделения
    btnDisabled: '#CCCCCC', // Цвет кнопок при отключении: серый

    accent: '#2196F3', // Цвет акцента для выделения: яркий голубой для привлечения внимания к важным элементам
  },
});
